04_perforatedPlate/20_noTextureZigZagPerforationV1/01_baseCaseInit/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues//Comment out if I do not want to rewrite the original field
(
    volScalarFieldValue alpha.liquid 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        box (0 0 0) (1 1 0.4e-3);
        fieldValues
        (
            volScalarFieldValue alpha.liquid 1
            volVectorFieldValue U (1 0 0)
        );
    }
);


// ************************************************************************* //
