04_perforatedPlate/20_noTextureZigZagPerforationV1/01_baseCaseInit/Allrun.pre
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# create mesh
runApplication blockMesh
#get rid of interfaces
#~ runApplication stitchMesh -perfect -overwrite overInletMaster overInletSlave
#convert holes to cyclic patches
runApplication createPatch -overwrite

# copy IC
mkdir 0
cp -rf 0.org/* 0

# set fields values
runApplication setFields
mv log.setFields log.setFieldsPreDecomposition


paraFoam -touch
